INSERT INTO producer(name, logo)
VALUES ('Agronutrition', '12c39d73-54d5-424f-8050-b7e2a3a826b1.png'),
       ('FMC Ukraine', 'b0f493d1-292c-450d-8aaf-efb7f154dac3.png'),
       ('Corteva Agriscience', '2e677cd1-163c-4a46-afce-ce7d0d9255be.png'),
       ('MAS Seeds', 'a9cd954c-c650-4bdd-9dfa-5c2de8738da7.png'),
       ('UPL', 'ff43b16d-d417-4edb-a054-50f409d73f62.png'),
       ('May Seeds', '366a719b-63b6-4976-b529-a513608d2447.png'),
       ('Bayer', '2a7a1133-f7f2-4643-bf9c-02636ee6eeb1.png'),
       ('Zhongshan Chemical', '1776ec18-9a68-433e-8c23-d953f08f4693.png'),
       ('BREVANT Seeds', null);

INSERT INTO category(name)
VALUES ('Засоби захисту рослин'),
       ('Насіння'),
       ('Мікродобрива');

INSERT INTO category(name, parent_category_id)
VALUES ('Гербіциди', 1),
       ('Фунгіциди', 1),
       ('Соняшник', 2),
       ('Кукуруза', 2),
       ('Рідкі мікродобрива', 3),
       ('Сухі мікродобрива', 3);

INSERT INTO category_property_group(name, category_id)
VALUES ('Агрономічні характеристики', 6),
       ('Рекомендована густота гібриду', 6),
       ('Агрономічні характеристики ', 7);

INSERT INTO category_property(group_id, name)
VALUES (1, 'Олійність'),
       (1, 'Середня висота рослини, см'),
       (1, 'Вегетаційний період, днів'),
       (1, 'Цвітіння, днів'),
       (2, 'Зона Степу'),
       (2, 'Зона Лісостепу'),
       (3, 'Середня кількість рядів в качані, шт'),
       (3, 'Середня кількість зерен в ряду, шт'),
       (3, 'Маса 1000 зерен, г зубовидний тип'),
       (3, 'Середня висота рослини, см'),
       (3, 'Висота кріплення качана, см');

INSERT INTO product(name, image, short_description, full_description, recommendations, producer_id, active, type, volume, unit,
                    category_id)
VALUES ('Рейна',
        'image1.png',
        'Рейна — стабільний гібрид соняшника, перевірений посухою',
        'Соняшник Рейна володіє стабільною врожайністю та високою енергією початкового росту. Обробляється згідно з класичною технологією вирощування соняшнику; відрізняється надзвичайною посухостійкістю і жаростійкістю.  Характеризується    високою стійкістю до вилягання та стресів;   відрізняється швидким стартовим розвитком. Погодні умови постійно змінюються, високі температури в травні місяці вже звичні, тому однією з вимог до гібридів соняшнику є посухостійкість. Рейна віддає вологу саме в період достигання, за рахунок чого відток пластичних речовин із стебла та листя проходить більш активно і негативний вплив спеки зменшується.',
        null,
        6, true, null, 100, 'SEED', 6),
       ('Дует КЛ',
        'image2.jpg',
        'Дует КЛ — ранній гібрид соняшника, лідер по урожайності за системою Clearfield®',
        'Гібрид Дует КЛ можливо висівати в усіх регіонах  України, починаючи  з Півдня (де проявиться його стійкість до стресових умов), в центральній Україні (тут він реалізує себе як типовий «степовик»), та закінчуючи Північчю (де знадобиться його короткий період вегетації та стійкість до хвороб).',
        null,
        6, true, null, 300, 'SEED', 6),
       ('Еленіс',
        'image3.png',
        'Еленіс —  стресостійкий гібрид соняшника Clearfield® Plus без обмежень по кліматичним зонам ',
        'Відрізняється високою стійкістю до посухи та ряду основних хвороб соняшнику. Гібрид досить пластичний, показує гарні результати врожайності як при інтенсивній, так і екстенсивній технології вирощування.',
        null,
        7, false, null, 100, 'SEED', 6),
       ('Харнес®, КЕ',
        'image-4.png',
        'Харнес® — селективний досходовий ґрунтовий гербіцид',
        null,
        null,
        7, false, 'PESTICIDE', 150, 'L', 4),
       ('Азокси-Стар, КС',
        'image5.png',
        'Азокси-Стар — системний фунгіцид захисної та контактної дії',
        null,
        'Перед початком робіт з Азокси-Стар, КС слід зробити розрахунок необхідної його кількості в залежності від норми витрати та площі поля, яке необхідно обробити. Налаштування обприскувача на потрібну норму витрати робочої рідини слід проводити згідно наведеної вище таблиці.',
        8, true, 'PESTICIDE', 5, 'L', 4),
       ('Сурреал (ФАО 370)',
        'ima6ge.png',
        'Сурреал — стійкий до стресів гібрид кукурудзи з високим потенціалом урожайності',
        null,
        'Рекомендована густота гібриду:
        недостатнє зволоження — 55-60 тис. шт/га
        достатнє зволоження — 60-65 тис. шт/га
        Рекомендована зона вирощування Сурреал:
        Степ, Лісостеп.
        Рекомендації щодо гібриду:
        Кукурудзу Сурреал (ФАО 370) треба висівати в оптимальні сроки;
        Гібрид придатний до вирощування в монокультурі;
        добре реагує на гарний агрофон.',
        9, true, null, 80000, 'SEED', 7);

INSERT INTO product_packages(product_id, price, count)
VALUES (1, 5353, 100),
       (1, 10000, 200),
       (2, 1234, 120),
       (3, 7905, 125),
       (4, 6430, 1),
       (5, 2563, 1);

INSERT INTO product_property_group(name, product_id)
VALUES ('Агрономічні характеристики', 1),
       ('Рекомендована густота гібриду', 1);

INSERT INTO product_property(group_id, name, value)
VALUES (1, 'Вегетаційний період, днів', '95-100'),
       (1, 'Середня висота рослини, см', '160-170'),
       (1, 'Вміст олії, %', '48-52'),
       (2, 'зона Степу', '50 тис. шт/га'),
       (2, 'зона Лісостепу', '55 тис. шт/га');

INSERT INTO pesticide(product_id)
VALUES (4),
       (5);

INSERT INTO pest(name)
VALUES ('Жучок'),
       ('Бур\'ян');

INSERT INTO culture(name)
VALUES ('Соняшник'),
       ('Буряк');

INSERT INTO pesticide_pests(pesticide_id, pest_id)
VALUES (4, 1);

INSERT INTO pesticide_cultures(pesticide_id, culture_id, min_volume, max_volume)
VALUES (4, 1, 2, 5),
       (4, 2, 3, 4);

INSERT INTO filters(name)
VALUES ('ФАО'),
       ('Виробнича технологія');

INSERT INTO filters(name, filter_group_id)
VALUES ('ФАО 100 – 199 (ранньостиглі)', 1),
       ('ФАО 200 – 299 (середньоранні)', 1),
       ('ФАО 300 – 399 (середньостиглі)', 1),
       ('ФАО 400 – 499 (середньопізні)', 1),
       ('ФАО 500 – 599 (пізньостиглі)', 1),
       ('Традиційні гібриди ', 2),
       ('Clearfield® гібриди', 2),
       ('Clearfield® Plus', 2),
       ('Сульфо', 2);

INSERT INTO category_filters(category_id, filter_id)
VALUES (7, 1),
       (6, 2);

INSERT INTO product_filters(product_id, filter_id)
VALUES (6, 5),
       (1, 7);
